tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "bash"
brew "glib"
brew "libxcb"
brew "libx11"
brew "libxext"
brew "ruby"
brew "cocoapods"
brew "exa"
brew "fish"
brew "fisher"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnutls"
brew "go"
brew "pkgconf"
brew "guile"
brew "harfbuzz"
brew "lazygit"
brew "python@3.12"
brew "libass"
brew "libslirp"
brew "node", link: false
brew "mongosh"
brew "neovim"
brew "openssl@1.1"
brew "podman", restart_service: true
brew "python@3.9"
brew "qemu"
brew "ripgrep"
brew "shared-mime-info"
brew "starship"
brew "stow"
brew "tlrc"
brew "z"
cask "arc"
cask "font-hack-nerd-font"
cask "kitty"
cask "raycast"
cask "shottr"
