tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "bash"
brew "exa"
brew "fish"
brew "fzf"
brew "git"
brew "git-delta"
brew "lazygit"
brew "node", link: false
brew "mongosh"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tlrc"
brew "zoxide"
cask "devcleaner"
cask "font-hack-nerd-font"
cask "kitty"
cask "raycast"
cask "shottr"
