tap "homebrew/bundle"
tap "homebrew/services"
tap "oven-sh/bun"
brew "bash"
brew "chezmoi"
brew "colima"
brew "docker"
brew "docker-compose"
brew "eza"
brew "fish"
brew "fzf"
brew "git"
brew "lazygit"
brew "node"
brew "mongosh"
brew "neovim"
brew "p7zip"
brew "ripgrep"
brew "rustup"
brew "starship"
brew "stow"
brew "tlrc"
brew "tree-sitter-cli"
brew "zoxide"
brew "oven-sh/bun/bun"
cask "appcleaner"
cask "clash-party"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "hammerspoon"
cask "kitty"
cask "pearcleaner"
